Jackhenry/Configs/9.8/ci-jackhenry-create_loan.json

{
    "validation_spec": "{}",
    "request_body_spec": "{\n    AccountId: {\n        AcctId: (.loan_number // \"\"),\n        AcctType: \"L\"\n    },\n    LnAdd: {\n        LnInfoRec: {\n            Term: {\n                TermCnt: (.loan_approval.approved_term // null),\n                TermUnits: \"Months\"\n            },\n            PmtTerm: \"001\",\n            PmtDayOfMonth:( if (\n                (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"29\")\n                or (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"30\")\n                or (.loan_approval.approved_first_payment_date | split(\"-\")[2] == \"31\")\n                ) then \n                    (.loan_approval.approved_first_payment_date) \n                else null \n                end\n            ),\n            PmtCode: (\n                ((.pricing_details[] \n                | select(.term_position == \"term_1\")\n                | $repaymentTypeMapping[.repayment_type]) // null)\n            ),\n            PmtAmt: (\n                (.loan_interfaces[] \n                | select(.is_latest==true and .interface_type==\"sherman\") \n                |(\n                    (.details.outLOAN_BUILDER.AmTable.AmLine[] \n                    | select(.Idx==\"1\")) | .Pmt | tonumber // null)\n                )\n            ),\n            PIAmt: (\n                (.loan_interfaces[] \n                | select(.is_latest==true and .interface_type==\"sherman\") \n                |(\n                    (.details.outLOAN_BUILDER.AmTable.AmLine[] \n                    | select(.Idx==\"1\")) | .Pmt | tonumber // null)\n                )\n            ),\n            OrigBal: (.approved_amount // \"\"),\n            OpenDt: (now | strftime(\"%Y-%m-%d\")),\n            OffCode: (.boarding_details.branch_code // null),\n            NxtSchedPmtDt: (.loan_approval.approved_first_payment_date // \"\"),\n            MatDt: (.maturity_date // \"\"),\n            IntRate: (.loan_approval.approved_rate/100 // \"\"),\n            IntBasis: ($accuralMapping[.accrual_method | tostring] // null),\n            BrCode: \"51\",\n            ProdCode: \"26\",\n            AcctStat: \"4\",\n            CustId: (.loan_relations[] | select(.is_primary_borrower == true) | .external_customer_id // \"\"),\n            OddDaysIntBasis: \"B\"\n        },\n        LnAcctInfo: {\n            VehicleId: (\n                if any(.collaterals[]; .category==\"vehicles\")\n                    then \"VIN\"\n                else null\n                end\n            ),\n            SubPrimeLnCode: \"N\",\n            State: (.loan_relations[] | select(.is_primary_borrower == true) | .state_of_establishment // \"\"),\n            PurpCode: \"98\",\n            PrtPastDueNotCode: \"Y\",\n            OrigLnToValRatio: (.approved_amount // null),\n            LateChgCode: \"CL1\",\n            DeptCode: \"C\",\n            CurLnToValRatio: (.approved_amount // null),\n            CrRatingCode: \"5\",\n            CollatCode: \"14\",\n            AnnIncmAmt: (.cra_gross_annual_revenue // null),\n            AcctClsfCode: \"Q\",\n            CombLTV: (.approved_amount // null),\n            CrScoreId: (.fico_score // null),\n            MoIncmAmt: (.cra_gross_annual_revenue/12 // null),\n            NumBorw: ( ([.loan_relations[] | select(.relation_type == \"borrower\")] | length) // null),\n            TotDebtPct: null,\n            LangType: \"English\",\n            CrRatingCode: \"5\",\n            BorwInfoArray: {\n                BorwInfo: {\n                    BorwFICOId: (.fico_score // null)\n                }\n            },\n            CrBureauRptCode: \"N\"\n        },\n        LnBalDtInfo: {\n            FirstPmtDt: (.loan_approval.approved_first_payment_date // \"\"),\n        },\n        LnPmtInfo: {\n            UsePmtSusp: \"N\",\n            BilLeadDays: \"15\"\n        },\n        LnRateInfo: {\n            RateVarCode: ( \n                .pricing_details[] | \n                select(.term_position == \"term_1\") | \n                if .margin > 0\n                    then \"Positive\"\n                elif .margin < 0\n                    then \"Negative\"\n                else null\n                end\n            ),\n            RateRevTermUnits: \"day\",\n            RateRevTerm: 1,\n            OrigIdxVal: ((.pricing_details[] | select(.term_position == \"term_1\") | .prime_rate) // null),\n            RateVar: ((.pricing_details[] | select(.term_position == \"term_1\") | .differential_rate) // null),\n            RateFlr: (.min_rate // null),\n            RateCeil: (.max_rate // null),\n        },\n        LnRealEstateInfo: (\n            .collaterals[0] | \n            {    \n                PropStreet: (\n                    .collateral_addresses[0] |\n                    select(.address_type == \"permanent\") |\n                    \"\\(.address_line_1) \\(.address_line_2)\"\n                ),\n                FloodInsurCode: (\n                    if .collaterals[0].is_flood_search_required == true\n                        then \"Y\"\n                    elif .collaterals[0].is_flood_search_required == false\n                        then \"N\"\n                    else null\n                    end\n                ),\n                ApprDt: ( .collaterals[0] | .collateral_appraisal.details?.report_due_date // null ),\n                OccupCode: null,\n                PropCounty: ( .collaterals[0] | .collateral_addresses[0] | .county // null ),\n                PropState: ( .collaterals[0] | .collateral_addresses[0] | .state // null ),\n                PropPostalCode: ( .collaterals[0] | .collateral_addresses[0] | .zip_code // null ),\n                PropCity: ( .collaterals[0] | .collateral_addresses[0] | .city // null ),\n                ApprVal: ( .collaterals[0] | .collateral_appraisal.details.report_price // null )\n            }\n        ),\n        LnRegRptInfo: {\n            NAICSCode: (.account_naics_code // null),\n            CRARec: (\n                .details.cra_details | \n                {\n                    CRAStateCode: (.cra_state_code // null),\n                    CRACountyCode: (.cra_country_code // null),\n                    CRACenTract: (.tract_code // null),\n                    CRASMSACode: (.MSA_code // null),\n                    CRALoc: (.address // null),\n                }\n            ),\n            CallRptCode: \"4A\",\n            Req1098: \"N\",\n            SBAGuarPct: (.sba_express_details.sba_guaranty_percent // null),\n            SBAGuarId: (.sba_number // null),\n            SBABasisPts: (if (.approved_amount <= 150000) then 1.50 else 3.00 end // null)\n        }\n    }\n}",
    "response_body_spec": "{ \n apiSuccess: .apiSuccess,\n errors: { \n errorNum: (if (.errors.errorNum != \"\" and .errors.errorNum != null) then .errors.errorNum else null end),\n errorMsg: ((if (.errors.errorNum != \"\" and .errors.errorNum != null) then .errors.errorMsg.Error else null end)) \n },\n responses: (if .apiSuccess == true and .responses.Id then [\n { \n status: .responses.Id \n }\n ] else [] end)\n}",
    "request_body_spec_config": "{\n \"repaymentTypeMapping\": {\n \"principal_and_interest\": 0,\n \"interest_only\": 2\n },\n \"accuralMapping\": {\n \"310\": 1,\n \"320\": 0,\n \"201\": 3\n }\n}",
    "xml_template": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"\n    xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n    <SOAP-ENV:Header>\n        <wsse:Security\n            xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\n            xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">\n            <wsse:UsernameToken\n                xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\">\n                <wsse:Username>{{XUserName}}</wsse:Username>\n                <wsse:Password\n                    Type=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText\">\n                    {{XPassword}}</wsse:Password>\n                <wsu:Created\n                    xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\">\n                    {{current_timestamp}}</wsu:Created>\n            </wsse:UsernameToken>\n        </wsse:Security>\n    </SOAP-ENV:Header>\n    <SOAP-ENV:Body>\n        <AcctAdd xmlns=\"http://jackhenry.com/jxchange/TPG/2008\">\n            <MsgRqHdr>\n                <jXchangeHdr>\n                    <JxVer />\n                    <AuditUsrId>{{XAuditUser}}</AuditUsrId>\n                    <AuditWsId>{{XAuditWorkStation}}</AuditWsId>\n                    <AuthenUsrId />\n                    <ConsumerName />\n                    <ConsumerProd />\n                    <Ver_1 />\n                    <jXLogTrackingId>{{$guid}}</jXLogTrackingId>\n                    <Ver_2 />\n                    <InstRtId>{{XInstitutionRoutingID}}</InstRtId>\n                    <InstEnv>{{XEnvironment}}</InstEnv>\n                    <Ver_3 />\n                    <BusCorrelId>{{$guid}}</BusCorrelId>\n                    <Ver_4 />\n                    <WorkflowCorrelId />\n                    <Ver_5 />\n                    <ValidConsmName>{{XValidConsumerName}}</ValidConsmName>\n                    <ValidConsmProd>{{XValidConsumerProduct}}</ValidConsmProd>\n                    <Ver_6 />\n                </jXchangeHdr>\n                <Ver_1 />\n                <Ver_2 />\n                <Ver_3 />\n            </MsgRqHdr>\n\n            <ErrOvrRdInfoArray>\n                <ErrOvrRd>\n                    <ErrCode />\n                    <Ver_1 />\n                    <BusSvcType />\n                    <Ver_2 />\n                </ErrOvrRd>\n                <ErrOvrRd>\n                    <ErrCode />\n                    <Ver_1 />\n                    <BusSvcType />\n                    <Ver_2 />\n                </ErrOvrRd>\n            </ErrOvrRdInfoArray>\n\n            <AccountId>\n                <AcctId>{{AccountId.AcctId}}</AcctId>\n                <AcctType>{{AccountId.AcctType}}</AcctType>\n            </AccountId>\n\n            <LnAdd>\n                <LnInfoRec>\n                    <Term>\n                        <TermCnt>{{LnAdd.LnInfoRec.Term.TermCnt}}</TermCnt>\n                        <TermUnits>{{LnAdd.LnInfoRec.Term.TermUnits}}</TermUnits>\n                    </Term>\n                    <RemPmtCnt>{{LnAdd.LnInfoRec.RemPmtCnt}}</RemPmtCnt>\n                    <PmtTermUnits>{{LnAdd.LnInfoRec.PmtTermUnits}}</PmtTermUnits>\n                    <PmtTerm>{{LnAdd.LnInfoRec.PmtTerm}}</PmtTerm>\n                    <PmtCode>{{LnAdd.LnInfoRec.PmtCode}}</PmtCode>\n                    <PmtAmt>{{LnAdd.LnInfoRec.PmtAmt}}</PmtAmt>\n                    <PIAmt>{{LnAdd.LnInfoRec.PIAmt}}</PIAmt>\n                    <OrigBal>{{LnAdd.LnInfoRec.OrigBal}}</OrigBal>\n                    <OpenDt>{{LnAdd.LnInfoRec.OpenDt}}</OpenDt>\n                    <OffCode>{{LnAdd.LnInfoRec.OffCode}}</OffCode>\n                    <MatDt>{{LnAdd.LnInfoRec.MatDt}}</MatDt>\n                    <IntRate>{{LnAdd.LnInfoRec.IntRate}}</IntRate>\n                    <BrCode>{{LnAdd.LnInfoRec.BrCode}}</BrCode>\n                    <ProdCode>{{LnAdd.LnInfoRec.ProdCode}}</ProdCode>\n                    <AcctStat>{{LnAdd.LnInfoRec.AcctStat}}</AcctStat>\n                    <CustId>{{LnAdd.LnInfoRec.CustId}}</CustId>\n                    <OddDaysIntBasis>{{LnAdd.LnInfoRec.OddDaysIntBasis}}</OddDaysIntBasis>\n                </LnInfoRec>\n\n                <LnAcctInfo>\n                    <SubPrimeLnCode>{{LnAdd.LnAcctInfo.SubPrimeLnCode}}</SubPrimeLnCode>\n                    <State>{{LnAdd.LnAcctInfo.State}}</State>\n                    <PurpCode>{{LnAdd.LnAcctInfo.PurpCode}}</PurpCode>\n                    <PrtPastDueNotCode>{{LnAdd.LnAcctInfo.PrtPastDueNotCode}}</PrtPastDueNotCode>\n                    <OrigLnToValRatio>{{LnAdd.LnAcctInfo.OrigLnToValRatio}}</OrigLnToValRatio>\n                    <LateChgCode>{{LnAdd.LnAcctInfo.LateChgCode}}</LateChgCode>\n                    <DeptCode>{{LnAdd.LnAcctInfo.DeptCode}}</DeptCode>\n                    <CurLnToValRatio>{{LnAdd.LnAcctInfo.CurLnToValRatio}}</CurLnToValRatio>\n                    <CrRatingCode>{{LnAdd.LnAcctInfo.CrRatingCode}}</CrRatingCode>\n                    <CollatCode>{{LnAdd.LnAcctInfo.CollatCode}}</CollatCode>\n                    <AnnIncmAmt>{{LnAdd.LnAcctInfo.AnnIncmAmt}}</AnnIncmAmt>\n                    <AcctClsfCode>{{LnAdd.LnAcctInfo.AcctClsfCode}}</AcctClsfCode>\n                    <CombLTV>{{LnAdd.LnAcctInfo.CombLTV}}</CombLTV>\n                    <CrScoreId>{{LnAdd.LnAcctInfo.CrScoreId}}</CrScoreId>\n                    <MoIncmAmt>{{LnAdd.LnAcctInfo.MoIncmAmt}}</MoIncmAmt>\n                    <NumBorw>{{LnAdd.LnAcctInfo.NumBorw}}</NumBorw>\n                    <TotDebtPct>{{LnAdd.LnAcctInfo.TotDebtPct}}</TotDebtPct>\n                    <CrBureauRptCode>{{LnAdd.LnAcctInfo.CrBureauRptCode}}</CrBureauRptCode>\n                    <PrtCouponBook>{{LnAdd.LnAcctInfo.PrtCouponBook}}</PrtCouponBook>\n                </LnAcctInfo>\n\n                <LnBalDtInfo>\n                    <FirstPmtDt>{{LnAdd.LnBalDtInfo.FirstPmtDt}}</FirstPmtDt>\n                </LnBalDtInfo>\n\n                <LnPmtInfo>\n                    <UsePmtSusp>{{LnAdd.LnPmtInfo.UsePmtSusp}}</UsePmtSusp>\n                    <BilLeadDays>{{LnAdd.LnPmtInfo.BilLeadDays}}</BilLeadDays>\n                </LnPmtInfo>\n\n                <LnRateInfo>\n                    <RateVarCode>{{LnAdd.LnRateInfo.RateVarCode}}</RateVarCode>\n                    <RateVar>{{LnAdd.LnRateInfo.RateVar}}</RateVar>\n                    <RateFlr>{{LnAdd.LnRateInfo.RateFlr}}</RateFlr>\n                    <RateCeil>{{LnAdd.LnRateInfo.RateCeil}}</RateCeil>\n                    <OrigIdxVal>{{LnAdd.LnRateInfo.OrigIdxVal}}</OrigIdxVal>\n                </LnRateInfo>\n\n                <LnRealEstateInfo>\n                    <PropStreet>{{LnAdd.LnRealEstateInfo.PropStreet}}</PropStreet>\n                    <PropState>{{LnAdd.LnRealEstateInfo.PropState}}</PropState>\n                    <PropPostalCode>{{LnAdd.LnRealEstateInfo.PropPostalCode}}</PropPostalCode>\n                    <PropCity>{{LnAdd.LnRealEstateInfo.PropCity}}</PropCity>\n                    <FloodInsurCode>{{LnAdd.LnRealEstateInfo.FloodInsurCode}}</FloodInsurCode>\n                    <ApprVal>{{LnAdd.LnRealEstateInfo.ApprVal}}</ApprVal>\n                    <ApprDt>{{LnAdd.LnRealEstateInfo.ApprDt}}</ApprDt>\n                    <OccupCode>{{LnAdd.LnRealEstateInfo.OccupCode}}</OccupCode>\n                    <PropCounty>{{LnAdd.LnRealEstateInfo.PropCounty}}</PropCounty>\n                </LnRealEstateInfo>\n\n                <LnRegRptInfo>\n                    <NAICSCode>{{LnAdd.LnRegRptInfo.NAICSCode}}</NAICSCode>\n                    <CallRptCode>{{LnAdd.LnRegRptInfo.CallRptCode}}</CallRptCode>\n                    <Req1098>{{LnAdd.LnRegRptInfo.Req1098}}</Req1098>\n                    <SBAGuarPct>{{LnAdd.LnRegRptInfo.SBAGuarPct}}</SBAGuarPct>\n                    <SBAGuarId>{{LnAdd.LnRegRptInfo.SBAGuarId}}</SBAGuarId>\n                    <SBABasisPts>{{LnAdd.LnRegRptInfo.SBABasisPts}}</SBABasisPts>\n                    <GLCostCtr>{{LnAdd.LnRegRptInfo.GLCostCtr}}</GLCostCtr>\n                </LnRegRptInfo>\n            </LnAdd>\n        </AcctAdd>\n    </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>",
    "response_body_spec_config": "{}",
    "xml_error_path": "s:Envelope/s:Body/s:Fault/detail/HdrFault/FaultRecInfoArray/FaultMsgRec/ErrDesc",
    "xml_success_path": "s:Envelope/s:Body/LnAppRgtrAddResponse/LnAppId",
    "xsd_name": "TPG_DepositMaster"
}